# Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Input: [1, 1, 2, 0, -1, 3, 4, 4]

# Output: 6

# Примечание: Пользователь может вводить значения списка или список задан изначально.


def SortList(list):
    count = 0
    for i in range(len(list)):
        if list[i] not in list[:i]:     # решение с помощью срезов
            count += 1
    print(count)


list = [1,3,4,5,9,1,1,5,2]    # ответ = 6
SortList(list)


# ОБЪЯСНЕНИЕ СРЕЗОВ
       # 0  1  2  3  4
# arr = [1, 2, 3, 4, 5]

# arr[1:3] -> [2, 3]
# arr[:3] -> [1, 2, 3]
# arr[2:] -> [3, 4, 5]
# arr[:] -> [1, 2, 3, 4, 5]
# arr[::2] -> [1, 3, 5]

# ___________________________________________________

list = [1,3,4,5,9,1,1,5,2]    # ответ = 6
list = set(list)     # переводим списки в множества, а так как множества имеют только уникальные элементы, 
print(len(list))     # то одинаковые самостоятельно удалятся.


# ___________________________________________________

list = [1,3,4,5,9,1,1,5,2]    # ответ = 6
already_seen = []

for i in range(len(list)):
    for j in range(len(already_seen)):
        if list[i] == already_seen[j]:
            break
    else:
        already_seen.append(list[i])

print(len(already_seen))

